const items = [
    {
      // 导航名称
      text: '一级标题',
      // 该导航下所有的可选项
      children: [
        {
          // 可选项的名称
          text: '甜点饮品',
          // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
          id: 1
        },
        {
          // 可选项的名称
          text: '生日蛋糕',
          // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
          id: 2
        },{
          // 可选项的名称
          text: '自助餐',
          // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
          id: 3
        },{
          // 可选项的名称
          text: '小吃快餐',
          // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
          id: 4
        },{
          // 可选项的名称
          text: '日式料理',
          // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
          id: 5
        },{
          // 可选项的名称
          text: '西餐',
          // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
          id: 6
        } 
      ]
    },
    {
        // 导航名称
        text: '二级标题',
        // 该导航下所有的可选项
        children: [
          {
            // 可选项的名称
            text: '甜点饮品',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1001
          },
          {
            // 可选项的名称
            text: '生日蛋糕',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1002
          },{
            // 可选项的名称
            text: '自助餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1003
          },{
            // 可选项的名称
            text: '小吃快餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1004
          },{
            // 可选项的名称
            text: '日式料理',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1005
          },{
            // 可选项的名称
            text: '西餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1006
          }
        ]
      },
      {
        // 导航名称
        text: '三级标题',
        // 该导航下所有的可选项
        children: [
          {
            // 可选项的名称
            text: '甜点饮品',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1001
          },
          {
            // 可选项的名称
            text: '生日蛋糕',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1002
          },{
            // 可选项的名称
            text: '自助餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1003
          },{
            // 可选项的名称
            text: '小吃快餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1004
          },{
            // 可选项的名称
            text: '日式料理',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1005
          },{
            // 可选项的名称
            text: '西餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1006
          }
        ]
      },
      {
        // 导航名称
        text: '四级标题',
        // 该导航下所有的可选项
        children: [
          {
            // 可选项的名称
            text: '甜点饮品',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1001
          },
          {
            // 可选项的名称
            text: '生日蛋糕',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1002
          },{
            // 可选项的名称
            text: '自助餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1003
          },{
            // 可选项的名称
            text: '小吃快餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1004
          },{
            // 可选项的名称
            text: '日式料理',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1005
          },{
            // 可选项的名称
            text: '西餐',
            // 可选项的id，高亮的时候是根据id是否和选中的id是否相同进行判断的
            id: 1006
          }
        ]
      }
  ]

export default items